tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

brew 'ag'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'figlet'
brew 'git'
brew 'ghi'
brew 'gnu-sed'
brew 'gnupg2', args: ['with-readline']
brew 'groovy'
brew 'gtypist'
brew 'libgit2'
brew 'leiningen'
brew 'lua'
brew 'luajit'
brew 'maven'
brew 'node'
brew 'python'
brew 'python3'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-client-server', 'with-lua', 'with-luajit', 'with-python3']
brew 'wget'
brew 'parallel'

# GNU utils to replace BSD findutils
tap 'homebrew/dupes'
brew 'grep', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']

# Neovim
tap 'neovim/neovim'
brew 'neovim'

# Cask
cask 'ccmenu'
cask 'dropbox'
cask 'freedom'
cask 'iterm2'
cask 'macvim'
cask 'spotify'
cask 'font-fira-mono'
cask 'font-fira-code'
