cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'

brew 'ag'
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'fasd'
brew 'figlet'
brew 'git'
brew 'ghi'
brew 'gnupg2', args: ['with-readline']
brew 'groovy'
brew 'gtypist'
brew 'libgit2'
brew 'leiningen'
brew 'lua'
brew 'luajit'
brew 'macvim'
brew 'maven'
brew 'python'
brew 'python3'
brew 'pv'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'parallel'

# GNU utils to replace BSD findutils
tap 'homebrew/dupes'
brew 'grep', args: ['with-default-names']
brew 'findutils', args: ['with-default-names']

# Neovim
tap 'neovim/homebrew-neovim'
brew 'neovim'
